In [32]:
## data Exploration
import pandas as pd 
#for postgres_sql.
import psycopg2
from sqlalchemy import create_engine

In [18]:
data= pd.read_csv('Walmart.csv',encoding_errors='ignore')
data.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [5]:
data.shape

(10051, 11)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [19]:
#to find the total number of null values.
data.isna().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [20]:
#find the duplicate values.
data.duplicated().sum()

np.int64(51)

In [21]:
#remove duplicates.
data.drop_duplicates(inplace=True)

In [22]:
# filling the missing values(numerical column)
from sklearn.impute import KNNImputer
imputer=KNNImputer(n_neighbors=3)
data['quantity']=imputer.fit_transform(data[['quantity']])

In [24]:
#filling missing values of categorical data 
data['unit_price']=data['unit_price'].mode()[0]

In [26]:
#verification.
data.isna().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [27]:
#type conversion.
data['unit_price']=data['unit_price'].str.replace('$','').astype(float)

In [29]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10000 non-null  int64
 1   Branch          10000 non-null  object
 2   City            10000 non-null  object
 3   category        10000 non-null  object
 4   unit_price      10000 non-null  float64
 5   quantity        10000 non-null  float64
 6   date            10000 non-null  object
 7   time            10000 non-null  object
 8   payment_method  10000 non-null  object
 9   rating          10000 non-null  float64
 10  profit_margin   10000 non-null  float64
dtypes: float64(4), int64(1), object(6)
memory usage: 937.5+ KB

In [30]:
#create new column
data['total']=data['unit_price'] * data['quantity']
data['total'].head()

0    441.0
1    315.0
2    441.0
3    504.0
4    441.0
Name: total, dtype: float64

In [31]:
data.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin', 'total'],
      dtype='object')

In [36]:
#sql connection
#psql
#host= localhost
#port=5432
#user=postgres
#password = 'your_password'

engine_postsql=create_engine("postgresql+psycopg2://postgres:admin@localhost:5432/Walmart_db")

try:
    engine_postsql
    print('successfully connected to PSQL')
except:
    print('unable to connect ')

successfully connected to PSQL

In [39]:
data.to_sql(name='walmart', con=engine_postsql, if_exists='append', index=False)

1000

In [38]:
data.columns=data.columns.str.lower()
data.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin', 'total'],
      dtype='object')